Autodesk.Revit.DB.Analysis.MEPAnalyticalNode.IsSameNode(Autodesk.Revit.DB.Analysis.MEPAnalyticalNode)
Verify if this node is connected to the other node and thus represents the same analytical node in the network.
other:
The other node to be compared.
Returns:
True if two nodes represent the same node of the network. Otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Analysis.MEPAnalyticalNode.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Analysis.MEPAnalyticalNode.Location
The location of this node.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPAnalyticalNode.IsFlowBlocked
Is the flow blocked at this analytical node?
Since:
2024

Autodesk.Revit.DB.Analysis.MEPAnalyticalNode.IsFocalNode
Is this node a focal point of multiple branches?
Since:
2024

Autodesk.Revit.DB.Analysis.MEPAnalyticalNode.Id
The identity used in the MEPAnalyticalSegment
Since:
2024

Autodesk.Revit.DB.Analysis.MEPAnalyticalNode
Represents an analytical node of the MEP analytical model.
Since:
2024